<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SettingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('settings')->truncate();
        $data = [
            [
                'key' => 'egypt_address',
                'value' => '32 Abbas alakaad ,Nasr city ,Cairo ,Egypt',
                'type' => 'text'
            ],
            [
                'key' => 'qatar_address',
                'value' => 'QFC tower 1, West bay, Doha, Qatar',
                'type' => 'text'
            ],
            [
                'key' => 'phone',
                'value' => '01017799580',
                'type' => 'text'
            ],
            [
                'key' => 'whatsapp',
                'value' => '01017799580',
                'type' => 'text'
            ],
            [
                'key' => 'email',
                'value' => 'info@paytecheg.com',
                'type' => 'text'
            ],
            [
                'key' => 'facebook',
                'value' => 'https://facebook.com/bokitapp',
                'type' => 'text'
            ],
            [
                'key' => 'twitter',
                'value' => 'https://twitter.com/bokitapp',
                'type' => 'text'
            ],
            [
                'key' => 'instagram',
                'value' => 'https://instagram.com/bokitapp',
                'type' => 'text'
            ],
            [
                'key' => 'snapchat',
                'value' => 'https://snapchat.com/bokitapp',
                'type' => 'text'
            ],
            [
                'key' => 'telegram',
                'value' => 'https://telegram.com/bokitapp',
                'type' => 'text'
            ],
            [
                'key' => 'terms',
                'value' => 'سياسية الاستعمال والخصوصية
للتجار والعملاء

التصديق على الاتفاقية

عند قيامك بالدخول أو التصفح والاتصال أو استعمال وإنشاء حساب على هذا التطبيق أو الموقع الإلكتروني المرتبطة به على أجهزة iPhone ، Android وأي تطبيق على الهاتف الجوال (والمشار إليها فيما بعد مجتمعين باسم "المنصة") والتي تشمل على سبيل المثال لا الحصر أي خدمات معروضة على المنصة؛ تقر بأنك قد قرأت وفهمت هذه الشروط والأحكام (والمشار إليها مجتمعين باسم "الشروط")، بما في ذلك هذه الشروط وأحكام سياسة الخصوصية الخاصة بنا المتاحة على موقعنا: www.hagzz.com وتوافق على الالتزام بها والامتثال لجميع القوانين واللوائح المعمول بها فيما يتعلق باستخدامك للمنصة. علاوة على ذلك، تقر بأن هذه الشروط تشكل عقدًا قانونيًا ملزمًا وساري النفاذ مبرم بينك وبين الشركة المالكة لعلامة” Hagzz” (والمشار إليه فيما يلي باسم ““Hagzz”"، "الشركة"، الضمير "نحن"، "لدينا") بالرجوع إلى استخدام هذه المنصة. برجاء قراءة هذه الشروط قبل طلب أي خدمة من خلال تطبيقنا.

تصبح مستخدمًا للمنصة ("المستخدم" أو "انت/أنتم")، من خلال التصفح، أو الدخول، أو الاتصال، أو استخدام، أو إنشاء حساب على المنصة، ومن خلال ذلك فإنك تعلن موافقتك على الالتزام بهذه الشروط الواردة.

وبناء عليه، فأنت مسؤول عن اتخاذ جميع الترتيبات اللازمة لتتمكن من الوصول إلى المنصة ومسؤول أيضًا عن التأكد من أن جميع الأشخاص الذين يصلون إلى المنصة من خلال اتصالك بالإنترنت على دراية تامة بهذه الشروط وملتزمون بها. من خلال عرض، أو استخدام، أو الوصول، أو التصفح، أو إرسال أي محتوى، أو مادة على المنصة، فإنك توافق على هذه الشروط باعتبارها اتفاقية قانونية ملزمة دون أي قيد أو شرط. ومن هنا، يشمل المصطلح "انت" أو "أنتم" أي شخص أو كيان يقوم بعرض، أو استخدام، أو الوصول، أو تصفح، أو إرسال أي محتوى، أو مادة على هذه المنصة.

إذا كنت لا توافق على هذه الشروط، فلا يجوز لك استخدام هذه المنصة. وتحتفظ منصة “Hagzz” بالحق في تعديل هذه الشروط في أي وقت دون أي إشعار مسبق. ومن ناحية أخرى، توافق على أن كل زيارة تقوم بها للمنصة ينبغي أن تخضع للشروط على النحو المبين، وأن استمرارية استخدامك للمنصة الآن أو بعد إجراء التعديلات في هذه الشروط توكد قراءتك وقبولك وموافقتك على الالتزام بهذه التعديلات.

وصف الخدمات

تسمح منصة “Hagzz” لمستخدميها الذين يوافقون على شروطها باستخدام تطبيق إدارة ومن الملاعب والاكاديميات الرياضية والأندية الشريكة وما إلى ذلك والتي قد يتم تشغيلها وإدارتها من قبل أطراف أخرى أو شركات تابعة للمنصة (والتي يشار إليها فيما بعد باسم ("التجار").

إن الغرض من هذه المنصة هو توفير خدمة بسيطة ومريحة للمستخدمين من خلال وصلهم مع الملاعب والاكاديميات والأندية والمرافق الرياضية داخل منطقتهم للمواعيد المناسبة (والمشار إليها باسم "خدمتنا") تُمكنهم من طلب مواعيد التدريبات والملاعب والرياضات والمنتجات (يشار إليها فيما بعد باسم "الطلبات “). وتتيح الخيارات التفاعلية للمستخدمين إجراء الطلبات وإرسالها بنقرة زر واحدة. عندما تطلب طلبًا من تاجر، تعمل منصة “Hagzz” كوسيط نيابة عن التاجر لإتمام خدماتك من المنصة وإدارة تجربتك من خلال إدارة الخدمات. لقد قمنا بإنشاء المنصة لتكون بمثابة سوق لمستخدميها.

لا تقوم منصة “Hagzz” بالحجز ولا تتدخل بأي شكل من الأشكال في إنتاج أي خدمة ينتجها التجار؛ فما تٌقدمه هذه المنصة للمستخدمين هو امكانية البحث والعثور على الأماكن والمواعيد المناسبة وتمكنهم من طلبها خلال هذه المنصة. وهكذا، يلتزم التجار بالقوانين والقواعد واللوائح والمعايير،

ومع ذلك، يجب على المستخدمين فهم وإدراك أن منصة “Hagzz” لا تتحقق بأي شكل من الأشكال بصورة مستقلة من بيانات اعتماد، أو إقرارات، أو منتجات، أو خدمات التجار، أو مكونات، أو جودة أي منتجات، أو خدمات، أو أن التاجر يلتزم بالقوانين المعمول بها. يجب أن يشعر المستخدمون بالراحة والسهولة من خلال المعلومات التي يقدمها التجار على المنصة أو بناءً على طلب المستخدمين مباشرةً من التجار فيما يتعلق بجودة وموثوقية التجار، فضلاً عن مدى امتثالهم للقوانين السارية.

لذلك، نحن نحتفظ بالحق، ولكننا لسنا ملزمين، في تقييد، أو تحديد الخدمات، أو المنتجات لأي شخص، أو منطقة جغرافية، أو ولاية. نظرًا للقوانين السارية في بعض البلدان، لن نقوم بعرض معين حيث يعد أي عرض لأي سلع يتم إجراؤها على المنصة لاغيًا وباطلاً عندما يحظره القانون."

علاوة على ذلك، لا تضمن منصة “Hagzz” بأي شكل من الأشكال نوعية أي خدمات أو مدى تطابق أي خدمات مع القوانين المعمول بها ولا تضمن مطابقة قائمة الخدمات المعروضة على المنصة مع ما يتم توفيره بالفعل للمستخدمين. بالإضافة إلى ذلك، قد يقر التاجر بأن تحضير السلع والخدمات يتوافق مع معايير خاصة.

ومن هذا المنطلق، تسعى منصة “Hagzz” والتجار بها (حسبما تقتضي الحالة) بشكل معقول إلى الالتزام بتعليماتك الخاصة بطلب ما. ومع ذلك، في بعض الحالات التي لا يكون فيها ذلك ممكنًا أو متاحًا أو معقولًا من الناحية التجارية، تحتفظ منصة “Hagzz” و/أو التجار بالحق في المضي قدمًا في إعداد الطلب وفقًا لإجراءات التشغيل القياسية، إلا أن ليست منصة “Hagzz” ولا التجار مسؤولين عن استبدال أو استرداد طلب لا يتماشى مع التعليمات الخاصة التي طلبتها.

كما لن يكون موقع “Hagzz” مسؤولاً قانونيًا أو يتحمل المسؤولية تجاه أي سلع أو خدمات يقدمها التجار تكون غير صحية، أو سببًا لحدوث ضرر أو غير مقبولة للمستخدمين أو لا تلبي توقعات المستخدمين بأي صورة من الصور.

يرجى العلم أن التاجر سيفعل كل ما في وسعه للوفاء بوقت تنفيذ الخدمات في الوقت المحدد، ومع ذلك قد تتأثر أوقات التسليم بعوامل خارجة عن إرادته وبالتالي لا يمكن ضمان الوفاء بمواعيد التسليم. سنبلغك إذا علمنا بحدوث تأخير غير متوقع.

1. طبيعة المحتوى الذي يظهر على خدماتنا: -

1.1.    نظرة عامة قد تتضمن خدماتنا نصًا، أو بيانات، أو رسومات، أو صورًا، أو أي محتوى آخر (يُشار إليه إجمالاً باسم "المحتوى") أنشأناه بمعرفتنا أو من قبل الغير، بما في ذلك المتعاقدين للتسويق مع “Hagzz” من مقدمي خدمات الملاعب والاكاديميات والتدريبات الرياضية والمنتجات الرياضية

1.2.    خدماتنا تشمل خدماتنا هذا الموقع والتطبيق مما يتيح للمستخدمين التعرف على خدمات الملاعب والتدريبات الاكاديميات الرياضية والمنتجات الرياضية لديهم بما في ذلك خدمات الملاعب والتدريبات الاكاديميات الرياضية والمنتجات الرياضية يُشار إلى خدماتنا العامة والمحمية إجمالًا باسم "الخدمات". بمعنى آخر، تهدف خدماتنا فقط إلى مساعدتك في البحث و "موعد أو تدريب أو منتج "مع مقدم الخدمة. أنت تعلم بأن بعض الخدمات متاحة تحت أسماء مختلفة. أنت تعلم أيضًا بأنه قد يتم توفير الخدمات من قبل (1) بعض الشركات الفرعية والتابعة لـ “Hagzz” أو (2) مقدمي الخدمات.

1.2.1.   الخدمات العامة نُتيح بعض الخدمات بدون تسجيل أو كلمة مرور أو رقم الهاتف. يجوز لك استخدامها شكل شخصي غير تجاري طالما أنك تمتثل لهذه الشروط. تتضمن هذه الخدمات دلائل ("الدلائل") أصحاب ومديري وممثلو الاكاديميات والملاعب والمرافق والمتاجر الرياضية يُشار إليها إجمالًا باسم ("مقدمو الخدمات"). حيث يتم تقديم هذه الدلائل لراحتك. تشمل الدلائل فقط مقدمي الخدمات الذين يستخدمون خدماتنا والذين اختاروا المشاركة في الدلائل. لا يشكل إدراج مقدمو الخدمات في الدلائل توصية لخدمات مقدم الخدمة هذا أو ضمانًا لشهاداته أو مؤهلاته. نظرًا لأن جميع المعلومات يتم نقلها على النحو الذي قدمه مقدمو الخدمات، وبينما نبذل جهودًا معقولة لتزويدك بمحتوى دقيق، فإننا لا نضمن، أو نمثل، أو نكفل دقة أي معلومات فيما يتعلق بالمؤهلات المهنية، الخبرات، أو جودة العمل، أو معلومات السعر، أو التكلفة، أو التأمين، أو أي محتوى آخر متاح من خلال الخدمات، سواء كانت صريحة أو ضمنية. ولن نتحمل بأي حال من الأحوال المسؤولية تجاهك أو تجاه أي شخص آخر عن أي قرار أو إجراء تتخذه اعتمادًا على أي محتوى من هذا القبيل. نحن لا نؤيد أو نوصي بأي شكل من الأشكال بأي فرد أو كيان مُدرج أو يمكن الوصول إليه من خلال الخدمات. بينما يمكن إجراء الحجوزات وخلافه من الخدمات من خلال موقعنا او التطبيق، لا يمكننا ضمان توافر مقدم الخدمات ذي الصلة، ولا يمكننا توقع إلغاء مواعيده.

1.2.2.  الخدمات المحمية بعض خدماتنا محمية بواسطة تدابير تقنية تهدف إلى حماية سرية المعلومات الحساسة وسلامتها وإمكانية الوصول إليها والتي يقوم المستخدمون بتخزينها ومشاركتها باستخدام خدماتنا؛ تتطلب هذه الضمانات من كل مستخدم المصادقة بشكل صحيح عن طريق التفويض ("بيانات الاعتماد")، مثل المعرفات الفريدة وأسماء المستخدمين وكلمات المرور وارقام الهاتف وما شابه. ومن أجل الحصول على بيانات الاعتماد، يجب عليك تقديم معلومات معينة عن نفسك. إذا كنت تقوم بالتسجيل في خدمة محمية، أو تقوم بالوصول إلى خدمة محمية أو استخدامها، أو تحاول الوصول إليها أو استخدامها، نيابة عن، أو لصالح، شخص آخر غيرك - مثل أي من أفراد عائلتك ("الفاعل الأصلي") - يجب عليك أيضًا تحديد وتقديم معلومات حول كل فاعل. هذه الخدمات المحمية هي جميع الخدمات التي تُنشئ لك سجلاً شخصيًا ("السجل الشخصي")، مثل تلقي معلوماتك والنتائج من مقدمي الخدمات مثل هذه البيانات خاصة ومؤمنة تمامًا ونضمن لك ذلك. تُعتبر أنت مالك البيانات الوحيد، وبمجرد النقر على "أوافق"، فإنك تمنح مقدمي الخدمات الحق في إرسال المعلومات إليك من خلال حسابك الخاص على الموقع. ومن أجل مساعدتك في إنشاء سجلك الإلكتروني، يمكنك الموافقة على إرسال نسخة من هذه البيانات إلى التاجر الذي يُقدم الخدمة من خلال خدماتنا، والتي ستتم حمايتها والحفاظ على خصوصيتها بالإضافة إلى عدم مشاركتها مع الغير. سيحتفظ المرفق والأكاديمية بهذه البيانات باسمك في حسابه لإنشاء سجلك الالكتروني. في حالة عدم موافقتك على الاحتفاظ بسجل لبياناتك، يمكنك إرسال طلبك إلى “Hagzz” لإبداء رغبتك في عدم مشاركته، وستلتزم “Hagzz” بالامتثال لهذا الطلب.

1.2.3 المحتوى تُتيح لك خدماتنا الوصول إلى التدريبات الرياضية والحجوزات والمنتجات الرياضية المتوفرة حيث يمكن لمختلف المستخدمين مشاركة المعلومات والآراء والتقييمات والمحتويات الأخرى. نحن بشكل عام لا نفرز مسبقًا المحتوى المقدم أو نتابعه، وقد يمثل هذا المحتوى رأي المستخدم ببساطة. قد تتضمن خدماتنا أيضًا نتائج الاستقصاء أو التقييمات أو الشهادات ("التقييمات") من المستخدمين الذين قد يؤيدون أو يوصون أو ينتقدون أو يحللون أو يقيّمون أو يوضحون بطريقة أخرى مقدمي الخدمات وطبيعة الخدمات أو جودتها التي يتلقاها هذا المستخدم. هذه التقييمات هي حسابات مباشرة للمستخدمين الفرديين، ولا تشكل حكم مقدم الخدمات. لعلك تدرك أن التقييمات الواردة في الموقع هي من أولئك الذين يقدمونها، وأنها لا تعكس آراء “Hagzz”، ولا تشكل بأي حال من الأحوال تأييدنا أو توصيتنا لها. وبالتالي، لن تتحمل “Hagzz” أي مسؤولية عن أي من التقييمات المنشورة. علاوة على ذلك، يجب أن تضع في اعتبارك أن التقييمات عُرضة للأخطاء والتحيزات الشائعة في الحسابات القصصية المباشرة، ولا يُفترض أن تكون موثوقة أو خالية من الأخطاء. أي محتوى تحصل عليه أو تستقبله من “Hagzz” أو موظفيها، أو المقاولين، أو الشركاء، أو الرعاة، أو المعلنين، أو المرخصين، أو غير ذلك من خلال الخدمات، هو لأغراض إعلامية وأغراض التنظيم والدفع فقط. حيث إن جميع المعلومات للأغراض الإعلامية فقط، فإذا كنت تعتمد على أي محتوى، بما في ذلك المراجعات، فأنت تقوم بذلك على مسؤوليتك الخاصة. لذلك نشجعك على تأكيد أي محتوى ذي صلة بك بشكل مستقل مع مصادر أخرى.

2. سياسة الخصوصية والأمان

2.1 تعتبر “Hagzz” والشركات التابعة لها أن خصوصية معلوماتك من أهم العناصر في علاقتنا معك. مسؤوليتنا في الحفاظ على سرية معلوماتك هي مسؤولية نأخذها على محمل الجد. نحن مطالبون بموجب القانون بالحفاظ على خصوصية وأمان معلوماتك المحمية. سنخبرك على الفور في حالة حدوث خرق قد يكشف عن خصوصية أو أمان معلوماتك.

2.2 لمزيد من الحماية لسرية المعلومات وسلامتها وتوافرها على “Hagzz” ومشاركتها، بالإضافة إلى استقرار خدماتنا، فإنك توافق على الضمانات الإضافية التالية. وبناءً على ذلك، فإنك توافق على أنك لن تفعل ولن تحاول:

•        الوصول إلى خدماتنا، أو استخدامها، أو نشرها، أو أي معلومات، أو ملفات يمكن الوصول إليها عبر خدماتنا، بطريقة تنتهك القوانين واللوائح المعمول بها أو حقوق أي فرد أو كيان

•        بيع أو تحويل أي معلومات مُدرجة في خدماتنا أو استخدام تلك المعلومات لتسويق أي منتج أو خدمة - بما في ذلك عن طريق إرسال أو تسهيل إرسال رسائل البريد الإلكتروني غير المرغوب فيها أو الرسائل الاقتحامية (SPAM)؛

•        بحث أو فحص أو اختبار نقاط الضعف في خدماتنا، أو النظام أو الشبكة التي تدعم خدماتنا، أو التحايل على التدابير الأمنية أو المصادقة؛

•        تعطيل أو إغفال أو تجاوز أو تجنب، أو إزالة، أو إلغاء تنشيط، أو التحايل بطريقة أخرى على أي تدابير فنية نُجريها لحماية استقرار خدماتنا، أو سرية، أو سلامة، أو توافر أي معلومات، أو محتوى، أو بيانات موجودة في خدماتنا؛

•        تقديم خدماتنا لأي برنامج أو رمز أو أي جهاز آخر (1) يسمح بأي طريقة بالوصول غير المصرح به إلى أنظمتنا، أو أي برامج، أو أجهزة، أو ملفات، أو بيانات موجودة عليها، (2) تعطيل، أو إتلاف، أو التدخل، أو التأثير سلبًا على تشغيل أنظمتنا، أو أي برامج، أو أجهزة، أو ملفات، أو بيانات موجودة عليها، أو (3) يثقل أو يتداخل مع الأداء الوظيفي لخدماتنا؛

•        تفكيك أو عكس هندسة خدماتنا؛

•        الحصول على أو استرداد أو فهرسة أو نشر أي جزء من خدماتنا ما لم تكن محرك بحث عام يشارك في خدمات البحث العامة.

•        تعطيل أو التحايل على ضمانات استخدام واجهة برمجة التطبيقات لدينا، بما في ذلك الضمانات المصممة لتنظيم طبيعة أو مقدار البيانات التي يُسمح لك باستخراجها من خدماتنا، أو تكرار الوصول إلى هذه البيانات؛ أو إجراء مكالمات إلى واجهة برمجة التطبيقات الخاصة بنا بخلاف تلك المصرح بها في وثائق واجهة برمجة التطبيقات لدينا.

•        إزالة أي حقوق نشر أو علامة تجارية أو إشعارات حقوق الملكية الأخرى الواردة في خدماتنا.

•        المشاركة في أي نشاط آخر غير المسموح به صراحةً في هذه الشروط.

2.3 يخضع استخدامك للتطبيق أو الموقع لسياسة الخصوصية التي تطبقها الشركة وفقا لأحكام القانون رقم (13) لسنة 2016 بشأن حماية خصوصية البيانات الشخصية.

2.4 تسري أحكام هذا القانون على البيانات الشخصية عندما تتم معالجتها على نحو إلكتروني، أو يتم الحصول عليها أو جمعها أو استخراجها على أي نحو آخر تمهيدًا لمعالجتها إلكترونيًا، أو تتم معالجتها عن طريق الجمع بين المعالجة الإلكترونية والمعالجة التقليدية، ولا تسري أحكام هذا القانون على البيانات الشخصية التي يقوم الأفراد بمعالجتها في نطاق شخصي أو عائلي، أو البيانات الشخصية التي تتم معالجتها بغرض الحصول على البيانات الإحصائية الرسمية وفقًا لأحكام القانون رقم (2) لسنة 2011.

2.5 يُحظر إرسال أي اتصال إلكتروني بغرض التسويق المباشر إلى الفرد، إلا بعد الحصول على موافقته المسبقة وفقا لأحكام المادة (22) من القانون أعلاه.

2.6 لكل فرد الحق في حماية خصوصية بياناته الشخصية، ولا يجوز معالجة تلك البيانات إلا في إطار الشفافية والأمانة واحترام كرامة الإنسان والممارسات المقبولة، وفقًا لأحكام هذا القانون.

2.7 لا يجوز للمراقب معالجة البيانات الشخصية، إلا بعد الحصول على موافقة الفرد، ما لم تكن المعالجة ضرورية لتحقيق غرض مشروع للمراقب أو الغير الذي تُرسل إليه البيانات.

2.8 ويجب أن يتضمن الاتصال الإلكتروني هوية مُنشئه، وما يفيد بأنه مرسل لأغراض التسويق المباشر، كما يجب أن يتضمن عنوانًا صحيحًا يسهل الوصول إليه، ويستطيع الفرد من خلاله أن يرسل طلبًا إلى المنشئ بإيقاف تلك الاتصالات أو الرجوع في موافقته على إرسالها.

2.9 المعلومات التي يشاركها المستخدمون العملاء - مع الشركة سواء كانت المعلومات الخاصة بالمعاملات الشرائية، أو بياناتهم الشخصية في تسجيل الدخول، تعد بيانات خاصة جدًا يجب أن يتم تقنين استخدامها وحدود هذا الاستخدام.

3. الدفع

3.1 تحصيل المدفوعات

3.1.1 يمكنك الدفع عبر الإنترنت من خلال موقعنا أو تطبيقنا. عند تحصيل المبالغ نيابة عن مقدمي الخدمات، فإنك توافق صراحًة على الالتزام بشروط الدفع الخاصة بمقدم الخدمة هذا. وعند الاقتضاء، سنقوم بتضمين أية ضرائب. نقبل حاليًا الدفع من خلال بطاقات الائتمان / الخصم أو الخدمات الفورية أو المحافظ الرقمية. أنت توافق على إجراء جميع هذه المدفوعات في الوقت المناسب، وتقر بأنك مسؤول عن أي مبالغ مرتبطة بحسابك. واعتمادًا على الخدمة، سنقوم بتحصيل المدفوعات قبل أو بعد تقديم الخدمة.

3.1.2 نحتفظ بالحق في تحديد أو تعديل أو إزالة أي رسوم، وفقًا لتقديرنا الخاص. قد نقدم أيضًا عروضًا ترويجية أو خصومات، والتي ستغير المبلغ المدفوع، ولكن تخضع فقط لشروط وأحكام هذا العرض الترويجي أو الخصم.

3.1.3تحويل العملات ، تعتمد أسعار العملات على المصادر المتاحة للجمهور ويجب استخدامها للاسترشاد فقط ، وأسعار الخدمات غير مضمونة إلا بالعملة المحلية لدولة المستضيف فقط ، ولا يتم تحديث أسعار العملات يوميًا، يفترض أن تكون معلومات العملات الواردة على هذا الموقع دقيقة، لكن شركة “Hagzz” لا تضمن هذه الدقة ولا تتعهد بها. 

3.2 سياسة الاسترداد

3.2.1 الرسوم التي تدفعها نهائية وغير قابلة للاسترداد، ما لم تحدد “Hagzz” ومسئولين التحصيل خلاف ذلك.

3.2.2 تُسترد الأموال بنفس طريقة الدفع، إن وُجدت.

3.2.3 تحتفظ “Hagzz” بحقها في استرداد أي مبالغ إلى حساب المستخدمين لاستخدامها في خدمات أخرى وفقًا لتقديرها الخاص.

3.2.4 المبالغ المُستردة غير قابلة للتطبيق إذا كان المستخدم غير راضٍ عن الخدمة المُقدمة.

3.2.5 يحق للمستخدم استرداد كامل المبلغ إذا:

3.2.5.1. ألغى المستخدم ال قبل تاريخ الموعد قبل 72 ساعة من تاريخ بداية الحجز؛

3.2.5.2. ألغى مقدم الخدمة، أو لم يحضر، الموعد الذي دفع المستخدم من أجله؛',
                'type' => 'textarea'
            ],
            [
                'key' => 'youtube',
                'value' => 'https://youtube.com/bokitapp',
                'type' => 'text'
            ],
            [
                'key' => 'logo',
                'value' => 'aOlWdeNot6QWGJei6f5R97j8hAXZKowXV7pc5voe.png',
                'type' => 'image'
            ],
            [
                'key' => 'privacy',
                'value' => 'data',
                'type' => 'textarea',
            ],
        ];

        DB::table('settings')->insert($data);
    }
}
